[
  {
    "role": "Graduate Research Assistant",
    "organisation": "University of Arkansas at Little Rock",
    "startDate": "Aug, 2023",
    "endDate": "Present",
    "experiences": [
      "Designed and implemented scalable system architectures, facilitating the integration of new features and applications with minimal disruption.",
      "Conducted system performance analysis and implemented improvements, enhancing system response times by 20%.",
      "Managed MySQL databases, ensuring data integrity and optimizing query performance, resulting in a 15% increase in system efficiency."
    ],
    "imageSrc": "history/UALR.png"
  },
  {
    "role": "Software Developer",
    "organisation": "Servicenow",
    "startDate": "Aug, 2022",
    "endDate": "Jun, 2023",
    "experiences": [
      "Strong understanding of relational database principles, with experience in Oracle.",
      "Diagnosed and addressed maintenance and performance issues, leading to improved system stability.",
      "Provided consultation on functional requirements and actively participated in code review sessions to ensure code quality and adherence to specifications.",
      "Identified and implemented process improvements, leading to enhanced performance and efficiency of applications.",
      "Documented and interpreted test results, promptly correcting application coding errors to maintain high-quality software standards."
    ],
    "imageSrc": "history/servicenow.png"
  },
  {
    "role": "Software Engineer",
    "organisation": "Surgical Information Systems",
    "startDate": "May, 2019",
    "endDate": "July, 2022",
    "experiences": [
      "Led a project to upgrade the hospital's EHR system, which resulted in a 99% system uptime and a 20% improvement in overall system reliability.",
      "Ensured compliance with HIPAA regulations and guidelines in all system designs and implementations, protecting patient privacy and confidentiality.",
      "Developed and maintained MySQL databases, optimizing query performance and ensuring data integrity across multiple applications.",
      "Employed Git for robust version control, ensuring a systematic approach to code management, and consistently uploaded code alterations to the GitHub repository.",
      "Implemented indexing strategies and query optimizations that improved database performance by 25%.",
      "Led the development and maintenance of internal web applications using MySQL, HTML, and CSS, meeting security and performance standards."
    ],
    "imageSrc": "history/SIS.png"
  },
  {
    "role": "Data Analyst Intern",
    "organisation": "Henotic Analytics",
    "startDate": "Oct, 2018",
    "endDate": "Mar, 2019",
    "experiences": [
      "Managed and optimized MySQL databases to ensure data integrity and efficient query performance.",
      "Communicated effectively with customers, peers, and supervisors during the deployment of a new telehealth system, providingregular status updates and ensuring project milestones were met.",
      "Attended and actively engaged in department meetings to discuss the progress and challenges of the patient recordsystem,contributing to team goals and project planning."
    ],
    "imageSrc": "history/HenoticAnalytics.jpeg"
  }
]