[
  {
    "role": "Senior Software Engineer",
    "organisation": "College Board",
    "startDate": "Jan 2023",
    "endDate": "Present",
    "experiences": [
      "Integrated web forms on the College Board's website with Salesforce using Web-to-Lead functionality to automate lead capture and data entry.",
      "Developed and maintained web pages using HTML5, CSS3, JavaScript, and ReactJS to enhance user experience and optimize lead generation efforts.",
      "Implemented lead duplication detection processes in Salesforce to maintain data integrity and prevent redundant records.",
      "Configured lead assignment rules in Salesforce to automatically route leads to appropriate business users based on predefined criteria.",
      "Set up email notifications within Salesforce to alert team members of new lead assignments, ensuring timely follow-up.",
      "Developed custom Apex classes and Visualforce pages to extend Salesforce capabilities and meet specific business requirements.",
      "Created and managed the lead conversion process in Salesforce, transforming qualified leads into accounts, contacts, and opportunities.",
      "Collaborated with marketing and sales teams to map web form fields to Salesforce, ensuring accurate data capture and seamless integration.",
      "Optimized web-to-lead forms for mobile responsiveness and accessibility, increasing submission rates across devices.",
      "Troubleshoot and resolved issues related to lead capture and Salesforce integration, minimizing downtime and data loss.",
      "Implemented validation rules and workflows in Salesforce to enhance data quality and enforce business processes.",
      "Developed and updated standard operating procedures (SOPs) for web development and Salesforce integration tasks to ensure consistency and knowledge sharing.",
      "Utilized Asana for project management to coordinate tasks, track progress, and meet project deadlines.",
      "Provided training and support to business users on Salesforce functionalities and best practices for lead management.",
      "Ensured compliance with data protection regulations by implementing security measures in both web development and Salesforce environments."
    ],
    "imageSrc": "history/CollegeBoard.jpeg"
  },
  {
    "role": "Senior Software Engineer",
    "organisation": "Walmart",
    "startDate": "Jan 2023",
    "endDate": "May 2024",
    "experiences": [
      "Implemented multi-threaded Java applications, utilizing concurrency utilities like Executor Service and Countdown Latch.",
      "Leveraged Spring Data JPA to interact with Oracle database, including writing custom queries and integrating with existing database schemas.",
      "Implemented RESTful APIs with Spring MVC, handling request mapping, request/response handling, and error handling.",
      "Utilized Jest and Enzyme to create a comprehensive test suite, maintaining 92% code coverage and ensuring reliable application behaviour.",
      "Leveraged ES6 features including Promises and async/await, alongside React Hooks and Redux, to enhance code readability and effectively manage complex state in health insurance applications.",
      "Optimized RESTful APIs with rate limiting and JWT authentication, resulting in a 25% improvement in API response time.",
      "Collaborated with DevOps engineers to implement containerization using Docker and deployment to Kubernetes cluster.",
      "Implemented continuous monitoring and observability using the ELK stack, enabling proactive issue detection and a 50% reduction in mean time to resolution.",
      "Developed server-side applications and APIs using Node.js to build scalable and high-performance software solutions."
    ],
    "imageSrc": "history/Walmart.png"
  },
  {
    "role": "Software Engineer",
    "organisation": "Surgical Information Systems",
    "startDate": "May 2019",
    "endDate": "July 2022",
    "experiences": [
      "Designed and built robust backend services using .NET, Web API, and Entity Framework, achieving 99.9% uptime and handling over 1 million API requests per day.",
      "Optimized application performance by implementing code splitting, caching, and cross-browser compatibility testing, and reducing load times by 40%.",
      "Proficiency in customizing and extending Angular's built-in components to match the unique design requirements of the application, achieving a 95% end-user satisfaction rate.",
      "Led successful migration from AngularJS to Angular 8, implementing Angular CLI for enhanced performance and modern JavaScript standards.",
      "Developed a custom webhook system to facilitate asynchronous communication between the healthcare application and external services, improving reliability and scalability.",
      "Designed and maintained complex SQL Server databases, including schema migrations, indexing, and stored procedures, supporting over 1TB of patient data.",
      "Implemented batch processing and cron jobs for data synchronization, ensuring data integrity and timeliness, and reducing manual data processing by 60%.",
      "Automated the build, test, and deployment processes using Jenkins, GitHub Actions, and Azure DevOps, reducing deployment time by 75% and enabling 10 deployments per day.",
      "Implemented Factory and Singleton design patterns following SOLID principles in Java applications for health insurance enrollment."
    ],
    "imageSrc": "history/SIS.png"
  },
  {
    "role": "Associate Software Developer",
    "organisation": "Henotic Analytics",
    "startDate": "May 2018",
    "endDate": "Apr 2019",
    "experiences": [
      "Implemented client-side form validation and error handling using ReactJS form libraries or custom solutions.",
      "Utilized .Net features such as LINQ, async/await, and generics to enhance code efficiency and readability.",
      "Contributed to 10 user stories, ensuring on-time sprint goals. Led retrospectives, boosting team efficiency by 10% in subsequent sprints.",
      "Developed scalable code adhering to best practices, improving code quality by 20% through bi-weekly reviews and mentor feedback.",
      "Executed CRUD operations and implemented normalization techniques, ensuring 100% data integrity and optimal database structure."
    ],
    "imageSrc": "history/HenoticAnalytics.jpeg"
  }
]